[
{"league":"NHL","leagueName":"National Hockey League","country":"USA, Canada","foundedYear":"1917","numberOfTeams":"32","conferenceNames":"Eastern, Western","divisionNames":"Atlantic, Metropolitan, Central, Pacific","mostTitles":"Montreal Candiens - (25 Titles)","mostRecentTitles":"Florida Panthers","website":"www.nhl.com","logoFileName":"puck_logo_nhl.png","description":"Widely regarded as the most prestigious and competitive professional ice hockey league globally. It features the Stanley Cup, the oldest major professional sports trophy in North America. The league has a rich history including eras like the Original Six, major expansions, and significant labor stoppages. It has pioneered player safety initiatives and has been home to some of the sport’s most legendary players."}
,
{"league":"AHL","leagueName":"American Hockey League","country":"USA, Canada","foundedYear":"1936","numberOfTeams":"32","conferenceNames":"Eastern, Western","divisionNames":"Atlantic, North, Central, Pacific","mostTitles":"Hershey Bears (13 Titles)","mostRecentTitles":"Abbotsford Canucks","website":"www.theahl.com","logoFileName":"puck_logo_ahl.png","description":"Premier development league for the NHL, steeped in tradition and known for producing future stars while awarding the storied Calder Cup."}
,
{"league":"ECHL","leagueName":"ECHL","country":"USA, Canada","foundedYear":"1988","numberOfTeams":"30","conferenceNames":"Eastern, Western","divisionNames":"North, South, Central, Mountain","mostTitles":"Florida Everblades (4 Titles)","mostRecentTitles":"Trois-Rivieres Lions","website":"www.echl.com","logoFileName":"puck_logo_echl.png","description":"Nationwide minor league bridging the gap between the AHL and NHL, famed for the Kelly Cup and producing hundreds of future NHL players."}
,
{"league":"SPHL","leagueName":"Southern Professional Hockey League","country":"USA","foundedYear":"2004","numberOfTeams":"10","conferenceNames":"","divisionNames":"","mostTitles":"Knoxville Ice Bears (4 Titles), Pensacola Ice Flyers (4 Titles)","mostRecentTitles":"Evansville Thunderbolts","website":"www.thesphl.com","logoFileName":"puck_logo_sphl.png","description":"Independent minor league with deep southern roots, now stretching beyond its original footprint, where teams chase the President’s Cup in a fiercely loyal fan atmosphere."}
,
{"league":"FPHL","leagueName":"Federal Prospects Hockey League","country":"USA","foundedYear":"2010","numberOfTeams":"15","conferenceNames":"","divisionNames":"Continental, Empire","mostTitles":"Watertown Wolves (3 Titles)","mostRecentTitles":"Binghamton Black Bears","website":"www.federalhockey.com","logoFileName":"puck_logo_fphl.png","description":"Independent professional minor league known for its colorful history, frequent team changes, and the Commissioner's Cup championship, offering a gritty, unconventional path for players and fans alike."}
,
{"league":"LNAH","leagueName":"Ligue Nord-Américaine de Hockey","country":"Canada","foundedYear":"1996","numberOfTeams":"8","conferenceNames":"","divisionNames":"","mostTitles":"Thetford Assurancia (4 Titles)","mostRecentTitles":"Sorel-Tracy Éperviers","website":"www.lnah.com","logoFileName":"","description":"Known for its hard-hitting, physical style and frequent on-ice fights, earning a reputation as one of the world’s toughest hockey leagues. Many players are former NHL or AHL veterans, and the league’s draft allows older players, including those already drafted by the NHL, to compete. Its 2019-20 playoffs were suspended due to COVID-19, highlighting its recent challenges."}
,
{"league":"OHL","leagueName":"Ontario Hockey League","country":"Canada, USA","foundedYear":"1933","numberOfTeams":"20","conferenceNames":"Eastern, Western","divisionNames":"East, Cental, Midwest, West","mostTitles":"Oshawa Generals (13 Titles)","mostRecentTitles":"London Knights","website":"www.ontariohockeyleague.com","logoFileName":"puck_logo_ohl.png","description":"Premier major junior ice hockey league and a key part of the Canadian Hockey League system. It has evolved through several distinct eras of junior hockey in Ontario, continually developing as a highly marketable and widely broadcast league. The OHL operates independently from the Ontario Hockey Association, managing its own administration and competing for the prestigious Memorial Cup. The league has embraced digital innovation with initiatives like OHL Live Stream, making games accessible through pay-per-view broadband services."}
,
{"league":"QMJHL","leagueName":"Quebec Maritmes Junior Hockey League","country":"Canada","foundedYear":"1969","numberOfTeams":"18","conferenceNames":"Eastern, Western","divisionNames":"East, Maritimes, West, Central","mostTitles":"Gatineau Olympiques (7 Titles)","mostRecentTitles":"Moncton Wildcats","website":"www.theqmjhl.ca","logoFileName":"puck_logo_qmjhl.png","description":"Known for its fast-paced and offensive style, the QMJHL has produced many NHL stars and holds several Canadian Hockey League scoring records. It began as a merger of regional Quebec leagues and expanded into the Maritime provinces, recently updating its name and logo to reflect this broader reach. The league’s champions compete for the Memorial Cup alongside the OHL and WHL winners. The QMJHL also holds territorial draft rights in New England, highlighting its evolving recruitment."}
,
{"league":"WHL","leagueName":"Western Hockey League","country":"Canada, USA","foundedYear":"1966","numberOfTeams":"23","conferenceNames":"Eastern, Western","divisionNames":"Central, East, BC, US","mostTitles":"Kamloops Blazers (6 Titles), Medicine Hat Tigers (6 Titles)","mostRecentTitles":"Medicine Hat Tigers","website":"www.whl.ca","logoFileName":"puck_logo_whl.png","description":"Premier junior ice hockey league spanning Western Canada and the Northwestern United States, competing for the Ed Chynoweth Cup with the champion advancing to the Memorial Cup tournament. Originating as a vision to unify and strengthen western junior hockey competition, the league faced early challenges including sanctioning disputes and league realignments. Known for its rich history and memorable teams, the WHL has experienced periods of dynastic dominance and dramatic moments including expansions, relocations, and community tragedies that shaped its identity. Despite pandemic disruptions, the league remains a vital development platform for future hockey stars, continuing to evolve with new teams and expanded reach."}
,
{"league":"USHL","leagueName":"United States Hockey League","country":"USA","foundedYear":"1979","numberOfTeams":"16","conferenceNames":"Eastern, Western","divisionNames":"","mostTitles":"Waterloo Black Hawks (9 Titles)","mostRecentTitles":"Muskegon Lumberjacks","website":"www.ushl.com","logoFileName":"puck_logo_ushl.png","description":"The top Tier I junior ice hockey league sanctioned by USA Hockey, focused on developing amateur players aged 16 to 21. It provides a highly competitive environment with strict roster rules designed to promote American talent, especially goalies. Players often live with local families and balance hockey with education or part-time jobs. The league is a key pathway to NCAA college hockey and has produced numerous NHL players. Despite challenges like pandemic disruptions, the USHL remains a premier destination for elite junior hockey development."}
,
{"league":"NAHL","leagueName":"North American Hockey League","country":"USA","foundedYear":"1975","numberOfTeams":"34","conferenceNames":"","divisionNames":"Central, East, Midwest, South","mostTitles":"Detroit Jr. Red Wings (11 Titles)","mostRecentTitles":"Bismarck Bobcats","website":"www.nahl.com","logoFileName":"puck_logo_nahl.png","description":"Tier II junior ice hockey league sanctioned by USA Hockey, offering a competitive alternative for players seeking development beyond Tier I and Major Junior leagues. Teams span across the United States, providing players with equipment, uniforms, and billet housing support. The league allows more roster flexibility, especially for overage players, giving veterans additional NCAA exposure. NAHL teams compete annually for the Robertson Cup in Blaine, Minnesota. Many notable NHL alumni have progressed through the NAHL system, underscoring its role in developing hockey talent."}
,
{"league":"NA3HL","leagueName":"North American 3 Hockey League","country":"USA","foundedYear":"1970","numberOfTeams":"34","conferenceNames":"","divisionNames":"Central, East, Frontier, South, Southeast, West","mostTitles":"St Louis Jr Blues (6 Titles)","mostRecentTitles":"Louisiana Drillers","website":"www.na3hl.com","logoFileName":"puck_logo_na3hl.png","description":"Tier III junior ice hockey league in the United States sanctioned by USA Hockey. It serves as a developmental platform where young players compete to advance to higher levels of hockey, including college and professional ranks. The league is known for its competitive play across teams located in many states throughout the U.S."}
,
{"league":"NCAA Division I","leagueName":"National Collegiate Athletic Association Division I","country":"USA","foundedYear":"1947","numberOfTeams":"64","conferenceNames":"Atlantic Hockey, Big Ten, ECAC Hockey, Hockey East, NCHC, CCHA","divisionNames":"","mostTitles":"Michigan Wolverines (9 Titles)","mostRecentTitles":"Western Michigan Broncos","website":"www.ncaa.com/sports/icehockey-men/d1","logoFileName":"puck_logo_ncaadiv1.png","description":"The highest level of college ice hockey in the United States. It features teams competing in several conferences, offering a key development path for players aspiring to professional and international play. The league emphasizes both athletic and academic excellence."}
,
{"league":"NCAA Division II","leagueName":"National Collegiate Athletic Association Division II","country":"USA","foundedYear":"1978","numberOfTeams":"6","conferenceNames":"Northeast-10","divisionNames":"","mostTitles":"Assumption College (9 Titles)","mostRecentTitles":"Saint Michael's Purple Knights","website":"www.northeast10.org/sports/mice/index","logoFileName":"","description":"NCAA Division II Ice Hockey has fewer teams than Division I, mainly played in the Northeast-10 Conference. The NCAA discontinued the official Division II Championship in 1999 but the Northeast-10 continues to hold a conference championship."}
,
{"league":"PWHL","leagueName":"Professional Women's Hockey League","country":"Canada, USA","foundedYear":"2023","numberOfTeams":"8","conferenceNames":"","divisionNames":"","mostTitles":"Minnesota Frost (2 titles)","mostRecentTitles":"Minnesota Frost","website":"www.thepwhl.com","logoFileName":"","description":"The premier North American women's professional ice hockey league wholly owned by the Mark Walter Group. Featuring innovative rules such as a 3-2-1-0 points system, penalty terminations following short-handed goals, and controlled body checking, the league prioritizes competitive play and player safety. The PWHL represents the culmination of efforts by the Professional Women's Hockey Players Association to unify women's professional hockey under a stable, well-supported league with an eight-year collective bargaining agreement. Its inaugural season began in 2024, featuring six teams competing for the Walter Cup, with games broadcast nationally and internationally."}
,
{"league":"KHL","leagueName":"Kontinental Hockey League","country":"Russia, Belarus, Kazakhstan, China","foundedYear":"2008","numberOfTeams":"23","conferenceNames":"Western, Eastern","divisionNames":"Bobrov, Tarasov, Kharlamov, Chernyshev","mostTitles":"HC CSKA Moscow (3 Titles), Ak Bars Kazan (3 Titles), Metallurg Magnitogorsk (3 Titles)","mostRecentTitles":"Lokomotiv Yaroslavl","website":"www.khl.ru","logoFileName":"","description":"Widely regarded as Europe’s premier professional ice hockey league and ranks as the second-strongest worldwide, trailing only the NHL. Featuring clubs from Russia, Belarus, Kazakhstan, and China, the league awards the prestigious Gagarin Cup annually to its playoff champion. The KHL maintains a rigorous season and playoff structure split into Eastern and Western conferences, with best-of-seven series determining the champion. The league emphasizes competitive balance and has historically attracted top talent from across Eurasia, while honoring the legacy of teams such as Lokomotiv Yaroslavl."}
,
{"league":"SHL","leagueName":"Swedish Hockey League","country":"Sweden","foundedYear":"1975","numberOfTeams":"14","conferenceNames":"","divisionNames":"","mostTitles":"Djurgårdens IF (16 Title)","mostRecentTitles":"Luleå HF","website":"www.shl.se","logoFileName":"","description":"Sweden’s top professional ice hockey league and consistently ranks among the world’s strongest leagues. Known for its competitive play and strong development programs, the league features promotion and relegation with HockeyAllsvenskan, Sweden’s second-tier league. SHL teams regularly compete in the Champions Hockey League, showcasing European hockey talent on an international stage. The league rebranded from Elitserien to SHL in 2013 to strengthen its global identity and brand presence."}
,
{"league":"HockeyAllsvenskan","leagueName":"HockeyAllsvenskan","country":"Sweden","foundedYear":"2005","numberOfTeams":"14","conferenceNames":"","divisionNames":"","mostTitles":"","mostRecentTitles":"Djurgårdens IF","website":"www.hockeyallsvenskan.se","logoFileName":"","description":"The second-highest professional ice hockey league in Sweden, consisting of 14 teams competing in a round-robin format. Following the regular season, top teams enter multi-stage playoffs that determine promotion challenges against the lowest-ranked SHL teams. The league also features a relegation series with teams from the third-tier Hockeyettan to maintain league membership. HockeyAllsvenskan evolved through multiple format changes since its origins in the mid-20th century and has served as a key proving ground for teams aspiring to join the SHL."}
,
{"league":"EHL","leagueName":"EliteHockey Ligaen","country":"Norway","foundedYear":"1934","numberOfTeams":"10","conferenceNames":"","divisionNames":"","mostTitles":"Vålerenga (26 Titles)","mostRecentTitles":"Storhamar","website":"www.ehl.no","logoFileName":"","description":"Norway’s top professional ice hockey league, comprising 10 clubs with a promotion and relegation system involving the First Division. Teams compete annually for the national championship, with the top team qualifying for the IIHF Champions Hockey League. Established originally as Norway’s 1. divisjon in 1934, the league has evolved through rebrandings and sponsorships, adopting its current name in the 2023–24 season."}
,
{"league":"LIIGA","leagueName":"Finnish Elite League","country":"Finland","foundedYear":"1975","numberOfTeams":"16","conferenceNames":"","divisionNames":"","mostTitles":"Tappara (13 Titles)","mostRecentTitles":"KalPa","website":"www.liiga.fi","logoFileName":"","description":"Finland’s premier professional ice hockey league, renowned for its high skill level and passionate fan base. It features fierce competition among top Finnish clubs and serves as a crucial stepping stone for players aiming to compete internationally. Liiga teams regularly participate in the Champions Hockey League, highlighting Finland’s strong presence in European hockey."}
,
{"league":"ELH","leagueName":"Czech Extraliga","country":"Czech Republic","foundedYear":"1993","numberOfTeams":"14","conferenceNames":"","divisionNames":"","mostTitles":"HC Kometa Brno (14 Titles)","mostRecentTitles":"HC Kometa Brno","website":"www.hokej.cz/tipsport-extraliga","logoFileName":"","description":"The premier professional ice hockey league in the Czech Republic, known for its competitive play and passionate fan base. With 14 teams competing from September to April, the league features a playoff format that rewards consistent performance and exciting postseason matchups. ELH teams regularly participate in the Champions Hockey League, showcasing top Czech talent on the European stage. The league has a rich history of dominant clubs and intense rivalries, making it a central part of Czech sporting culture."}
,
{"league":"DEL","leagueName":"Deutsche Eishockey Liga","country":"Germany","foundedYear":"1994","numberOfTeams":"14","conferenceNames":"","divisionNames":"","mostTitles":"Eisbären Berlin  (11 Titles)","mostRecentTitles":"Eisbären Berlin","website":"www.penny-del.org","logoFileName":"","description":"Germany’s top professional ice hockey league, renowned for its passionate fanbase and competitive play. It operates independently from the German Ice Hockey Federation and features a playoff system similar to the NHL. The DEL introduced a promotion/relegation system with the DEL2 starting in the 2021–22 season, enhancing competition and league dynamics. The league regularly competes in the Champions Hockey League, showcasing German hockey talent internationally. Eisbären Berlin and Adler Mannheim are among the most successful clubs in recent years, with intense rivalries energizing the league."}
,
{"league":"NL","leagueName":"National League","country":"Switzerland","foundedYear":"1938","numberOfTeams":"14","conferenceNames":"","divisionNames":"","mostTitles":"HC Davos (31 Titles)","mostRecentTitles":"ZSC Lions","website":"www.nationalleague.ch","logoFileName":"","description":"Switzerland’s premier professional ice hockey league, known for its exceptionally high attendance figures—among the highest in Europe. The league’s playoff format features a best-of-seven series to crown the Swiss champion, while the bottom teams face a multi-stage relegation process, intensifying competition at both ends of the standings. NL teams consistently perform at a high level in the Champions Hockey League, reflecting the league’s strength within European hockey."}
,
{"league":"ICEHL","leagueName":"ICE Hockey League","country":"Austria, Italy, Hungary, Slovenia","foundedYear":"1923","numberOfTeams":"13","conferenceNames":"","divisionNames":"","mostTitles":"EC KAC (31 Titles)","mostRecentTitles":"Red Bull Salzburg","website":"www.ice.hockey/en","logoFileName":"","description":"The top-tier professional ice hockey league in Austria and Central Europe, featuring teams from multiple countries including Hungary, Italy, Slovenia, and the Czech Republic. It uniquely awards two titles: the overall League Champion and the Austrian Champion, the latter reserved for Austrian teams. The league is recognized for its competitive play and regularly qualifies multiple teams for the Champions Hockey League, showcasing its stature in European hockey."}
,
{"league":"Slovak Extraliga","leagueName":"Slovak Extraliga","country":"Slovakia","foundedYear":"1993","numberOfTeams":"12","conferenceNames":"","divisionNames":"","mostTitles":"HC Košice (10 Titles)","mostRecentTitles":"HC Košice","website":"www.hockeyslovakia.sk","logoFileName":"","description":"Tipsport Liga is Slovakia’s premier professional ice hockey league and the nation’s top competition. Its season features a regular round-robin schedule followed by playoffs, culminating in the crowning of the Slovak champion who receives the Vladimir Dzurilla Trophy. The league uses a points system rewarding regulation wins, overtime/shootout wins, and overtime/shootout losses, with relegation for the lowest-ranked team. Playoff qualification involves direct entry for the top six teams and a play-in series for seeds seven through ten. The league champion competes annually in the Champions Hockey League, reflecting its standing within European hockey."}
,
{"league":"AIHL","leagueName":"Australian Ice Hockey League","country":"Australia","foundedYear":"2000","numberOfTeams":"10","conferenceNames":"Bauer, Eastern","divisionNames":"","mostTitles":"Newcastle Northstars (6 Titles)","mostRecentTitles":"Canberra Brave","website":"www.theaihl.com","logoFileName":"puck_logo_aihl.png","description":"Australia’s premier semi-professional men’s ice hockey league, sanctioned by Ice Hockey Australia. The league operates with a conference system to manage travel costs and schedules. Teams compete annually for the Goodall Cup, one of the oldest ice hockey trophies in the world, and the H Newman Reid Trophy awarded to the regular season premiers. The league has evolved with expansions, conference restructuring, and partnerships to boost the sport nationally. Recent changes include expanded finals formats, broadcasting deals, and licensing updates, with teams occasionally withdrawing or rejoining due to rink availability or other logistical issues."}

]
